{
  "backend/main.mo": "Main backend actor implementing user profiles, product catalog (CRUD), shopping cart management, order processing with Stripe integration, and role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report documenting completed rebranding tasks including Narie name updates, 'Elegance in Floral' motto integration, logo asset integration, hero section updates, and floral-themed visual refinements.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the Narie-branded e-commerce application with routing, product catalog, cart, checkout, Stripe payment integration, and floral elegance theme.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with gold primary tones, teal accents, and cream backgrounds for light/dark modes, supporting the Narie floral elegance brand theme.",
  "frontend/index.html": "HTML entry point with 'Narie - Elegance in Floral' title, Narie logo favicon, and meta description for the rebranded botanical fashion application.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for home, products, product detail, cart, checkout, and payment pages, wrapped with ThemeProvider and Toaster.",
  "frontend/src/components/AdminPanel.tsx": "Admin-only modal dialog displaying PaymentSetup component for Stripe configuration, shown automatically when authenticated user has admin privileges.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product image, details, size, quantity controls with increment/decrement buttons, price calculation, and remove functionality.",
  "frontend/src/components/HeroSection.tsx": "Hero banner featuring Narie logo, 'Where Elegance Blooms' heading, 'Elegance in Floral' tagline, floral background image with gradient overlay, and call-to-action button linking to products.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, logo, authentication button, shopping cart icon with badge, and footer. Includes ProfileSetup and AdminPanel components and renders child routes via Outlet.",
  "frontend/src/components/PaymentSetup.tsx": "Admin component for configuring Stripe payment processing with secret key and allowed countries input. Shows success state when already configured or a form to enter credentials.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product with image, name, price, and available sizes as badges. Links to the product detail page with hover effects.",
  "frontend/src/components/ProductGrid.tsx": "Grid layout component that fetches and displays all products using ProductCard components. Shows loading skeletons, error states, and empty states.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and optional email. Cannot be dismissed until profile is created.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on authentication state. Invalidates dependent queries when actor changes and initializes access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages authentication state, identity persistence, and delegation validity checking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including products, cart operations, order summary, user profiles, admin checks, and Stripe configuration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like buttons, cards, sidebars, and charts using HSL color values.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantities and sizes, showing an order summary with total price, and providing navigation to checkout or back to products if cart is empty.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that collects shipping information (name, email, address), saves user profile, creates a Stripe checkout session with cart items, and redirects to Stripe payment flow.",
  "frontend/src/pages/HomePage.tsx": "Home page component that displays a hero section followed by a featured collection section with a product grid.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page displaying an error message with options to retry checkout or return to cart, informing users their cart items are saved.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success page showing confirmation message with a success icon and navigation options to return home or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page displaying product image, name, price, description, and size selection with add-to-cart functionality and navigation back to products list.",
  "frontend/src/pages/ProductsPage.tsx": "Products listing page with a header and ProductGrid component to display all available products in the shop.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system with CSS variables, custom fonts (Inter, Playfair Display), container settings, border radius variables, and custom shadow utilities for a floral-themed design system.",
  "project_state.json": "Project state tracking document for Narie e-commerce clothing website, listing 9 implemented features including product catalog, shopping cart, Stripe checkout, floral-themed branding with gold/teal colors, and logo integration with 'Elegance in Floral' motto."
}